Revit 2027 API
FabricationConfiguration.GetServiceTypeName Method
 Gets the service type name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetServiceTypeName(
	int serviceTypeId
)
Public Function GetServiceTypeName (
	serviceTypeId As Integer
) As String
public:
String^ GetServiceTypeName(
	int serviceTypeId
)
member GetServiceTypeName :
        serviceTypeId : int -> string
Parameters
serviceTypeId Int32
 The service type identifier.
Return Value
String
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace